using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class MonsterStat : MonoBehaviour
{
    public static string[] Name = { "고등어", "정어리", "말미잘", "흰동가리", "빨간 고등어","파란 흰동가리","분홍 말미잘","노란정어리","상어",
           "천사어","바다토끼","가오리","개복치","파란 천사어","노란 가오리","분홍 바다토끼","보라 개복치","배럴아이",
            "문어","바보 물고기","복어","뱀 물고기","빨간 뱀 물고기","분홍 복어","노란 문어","파란 바보 물고기","형광문어",
            "멍게","초롱낫 아귀","해파리","투명 오징어","파란멍게","분홍색 투명 오징어","검은 해파리","노란 초롱낫 아귀","벰파이어 오징어",
            "실러캔스","낚시꾼 아귀","아기 덤보문어","바다 두꺼비","빨간 낚시꾼 아귀","보라 실러캔스","파란 실러캔스","분홍 아기 덤보문어","검은 바다 두꺼비","초롱 아귀",
            "펠리컨 장어","달팽이 물고기","심해 곰치","심해 관벌레","파란 달팽이 물고기","분홍 심해 관벌레","노란 펠리컨 장어","파란 심해 곰치","검은 달팽이 물고기","거대 곰치" };
    public static int[] MonsterAttackStr = {0,0,15,0,0,0,20,0,0,30,30,40,0,40,50,50,0,0,10,100,20,20,25,30,15,150,0,30,100,
             50,30,40,40,70,120,0,200,150,200,210,170,250,270,280,300,0,250,100,220,100,120,120,300,250,180};
    public static int[] MonsterStr = {10,15,20,25,35,40,40,50,60,50,55,60,65,70,75,80,85,90,90,95,110,80,90,120,130,135,150,
             150,160,170,180,190,200,220,210,250,200,220,220,230,240,250,270,290,300,400,400,410,420,420,430,430,450,460,500,600};
    public static int[] MonsterTotalHp = { 40,45,50,55,60,75,80,90,150,100,110,120,80,140,150,160,90,250,250,260,270,280,290,300,310,320,380,
             350,360,370,380,390,400,410,420,550,600,630,660,690,720,750,780,810,850,1000,1000,1100,1300,1350,1400,1450,1500,1550,1700,2000};

}
